SeongMin1000/Embedded_System/micro_os/NUCLEO-f429zi_example_code (updated)/Examples/ST/STM32F429II-SK/OS3/app.c
  buffer[i] = '\0'; // 문자열 끝에 NULL
}

/*
*********************************************************************************************************
*                                       RTC FUNCTIONS
*********************************************************************************************************
*/

int is_valid_time_format(const char *str)
{
  // 1. 길이 확인
  if (strlen(str) != 8)
    return 0;

  // 2. ':' 위치 확인
  if (str[2] != ':' || str[5] != ':')
    return 0;

  // 3. 숫자 위치 확인
  for (int i = 0; i < 8; i++)
  {
    if (i == 2 || i == 5)
      continue;

    if (str[i] < '0' || str[i] > '9')
      return 0;
  }

  // 4. 숫자로 변환 후 범위 확인
  int hours = (str[0] - '0') * 10 + (str[1] - '0');
  int minutes = (str[3] - '0') * 10 + (str[4] - '0');
  int seconds = (str[6] - '0') * 10 + (str[7] - '0');

  if (hours > 23 || minutes > 59 || seconds > 59)
    return 0;

  return 1;
}

void RTC_CustomSetTime(uint8_t hours, uint8_t minutes, uint8_t seconds)
{
  RTC_TimeTypeDef RTC_Time;
  RTC_Time.RTC_Hours = hours;
  RTC_Time.RTC_Minutes = minutes;
  RTC_Time.RTC_Seconds = seconds;
  RTC_SetTime(RTC_Format_BIN, &RTC_Time);
}

void RTC_GetTimeStr(char *buf, size_t len)
{
  RTC_TimeTypeDef RTC_Time;
  RTC_GetTime(RTC_Format_BIN, &RTC_Time);
  snprintf(buf, len, "%02d:%02d:%02d", RTC_Time.RTC_Hours, RTC_Time.RTC_Minutes, RTC_Time.RTC_Seconds);
}

void RTC_SetAlarmDaily(void)
{
  // 1. 알람 인터럽트 비활성화 & 플래그 클리어
  RTC_AlarmCmd(RTC_Alarm_A, DISABLE);
  RTC_ClearITPendingBit(RTC_IT_ALRA);
  EXTI_ClearITPendingBit(EXTI_Line17);

  // 2. 외부 인터럽트 설정 (RTC 알람용 EXTI17)
  EXTI_InitTypeDef EXTI_InitStruct;
  EXTI_InitStruct.EXTI_Line = EXTI_Line17;
  EXTI_InitStruct.EXTI_Mode = EXTI_Mode_Interrupt;
  EXTI_InitStruct.EXTI_Trigger = EXTI_Trigger_Rising;
  EXTI_InitStruct.EXTI_LineCmd = ENABLE;
  EXTI_Init(&EXTI_InitStruct);

  // 3. 알람 시간 설정 ( 사용자 입력으로 변경 )
  USART_Config();
  uint8_t hours, minutes, seconds;
  char time_buffer[9]; // HH:MM:SS

  // 시간 입력 받기 (제대로 된 입력이 아닐 시 다시 입력 받도록 수정)
  while (1)
  {
    USART_SendString("시간을 입력하세요 (HH:MM:SS): ");
    USART_ReceiveString(time_buffer, 9);
    USART_SendString("\r\n");

    // 검증
    if (is_valid_time_format(time_buffer))
    {
      hours = (time_buffer[0] - '0') * 10 + (time_buffer[1] - '0');
      minutes = (time_buffer[3] - '0') * 10 + (time_buffer[4] - '0');
      seconds = (time_buffer[6] - '0') * 10 + (time_buffer[7] - '0');
      break;
    }

    USART_SendString("\r\n잘못된 시간 형식 또는 범위입니다. 다시 입력해주세요.\r\n");
  }

  RTC_AlarmTypeDef alarm;
  alarm.RTC_AlarmTime.RTC_Hours = hours;
  alarm.RTC_AlarmTime.RTC_Minutes = minutes;
  alarm.RTC_AlarmTime.RTC_Seconds = seconds;
  alarm.RTC_AlarmMask = RTC_AlarmMask_DateWeekDay; // 날짜 무시
  alarm.RTC_AlarmDateWeekDay = 1;                  // 무시됨
  alarm.RTC_AlarmDateWeekDaySel = RTC_AlarmDateWeekDaySel_Date;

  RTC_SetAlarm(RTC_Format_BIN, RTC_Alarm_A, &alarm);

  char alarm_time_msg[64];
  snprintf(alarm_time_msg, sizeof(alarm_time_msg), "\r\n%02d:%02d:%02d 에 알람이 울립니다...\r\n", hours, minutes, seconds);
  USART_SendString(alarm_time_msg);

  char buf[32];
  RTC_GetTimeStr(buf, sizeof(buf));
  USART_Config(); // 반드시 먼저 USART 초기화하고
  USART_SendString("\r\n[현재 시각] ");
  USART_SendString(buf);
  USART_SendString("\r\n");

  RTC_SetAlarm(RTC_Format_BIN, RTC_Alarm_A, &alarm);

  // 4. 인터럽트 설정 및 알람 켜기
  RTC_ITConfig(RTC_IT_ALRA, ENABLE);
  RTC_AlarmCmd(RTC_Alarm_A, ENABLE);

  // 5. NVIC 등록
  NVIC_EnableIRQ(RTC_Alarm_IRQn);
}

/*
*********************************************************************************************************
*                                       KNOCK SEONSOR FUNCTIONS
*********************************************************************************************************
*/

static uint8_t KnockSensor_Read(void)
{
  return GPIO_ReadInputDataBit(GPIOA, GPIO_Pin_6);
}

/*
*********************************************************************************************************
*                                           BUZZER FUNCTIONS
*********************************************************************************************************
*/

void Buzzer_On(void) // LOW에서 ON
{
  GPIO_ResetBits(GPIOA, GPIO_Pin_5);
}

void Buzzer_Off(void) //// HIGH에서 OFF
{
  GPIO_SetBits(GPIOA, GPIO_Pin_5);
}

/*
*********************************************************************************************************
*                                           JOYSTICK FUNCTIONS
*********************************************************************************************************
*/

// Read analog value
uint16_t JoyStick_ReadX(void)
{
  ADC_RegularChannelConfig(ADC1, ADC_Channel_0, 1, ADC_SampleTime_15Cycles);
  ADC_SoftwareStartConv(ADC1);
  while (ADC_GetFlagStatus(ADC1, ADC_FLAG_EOC) == RESET)
    ;
  return ADC_GetConversionValue(ADC1);
}

uint16_t JoyStick_ReadY(void)
{
  ADC_RegularChannelConfig(ADC1, ADC_Channel_7, 1, ADC_SampleTime_15Cycles);
  ADC_SoftwareStartConv(ADC1);
  while (ADC_GetFlagStatus(ADC1, ADC_FLAG_EOC) == RESET)
    ;
  return ADC_GetConversionValue(ADC1);
}

/*
*********************************************************************************************************
*                                           BUTTON FUNCTIONS
*********************************************************************************************************
*/

void Button_delay(uint32_t ms)
{
  for (uint32_t i = 0; i < ms * 4000; i++)
    __NOP();
}

/*
*********************************************************************************************************
*                                                main
*********************************************************************************************************
*/

// main()->AppTaskStart()->AppTaskCreate()

int main(void)
{
  OS_ERR err;

  /* Basic Init */
  RCC_DeInit();

  /* BSP Init */
  BSP_IntDisAll();

  CPU_Init();
  Mem_Init();
  Math_Init();

  // 현재 시간 설정
  RTC_CustomInit();
  RTC_CustomSetTime(8, 59, 55);

