SeongMin1000/Embedded_System/micro_os/NUCLEO-f429zi_example_code (updated)/Examples/ST/STM32F429II-SK/OS3/app.c
  while (DEF_TRUE)
  {
    // 1. 알람 울림 신호 기다림
    flags = OSFlagPend(&AlarmFlagGroup,
                       ALARM_FLAG_TOUCH,
                       0,
                       OS_OPT_PEND_FLAG_SET_ANY | OS_OPT_PEND_FLAG_CONSUME | OS_OPT_PEND_BLOCKING,
                       0,
                       &err);

    // 2. 터치센서 OFF될 때까지 대기
    while (GPIO_ReadInputDataBit(GPIOA, GPIO_Pin_3) == Bit_SET)
    {
      OSTimeDlyHMSM(0, 0, 0, 20, OS_OPT_TIME_HMSM_STRICT, &err);
    }
    prev = Bit_RESET;

    // 3. 터치 감지(딱 한 번)
    int touched = 0;
    while (!touched)
    {
      curr = GPIO_ReadInputDataBit(GPIOA, GPIO_Pin_3);
      if (curr == Bit_SET && prev == Bit_RESET)
      {
        // MissionTask에 신호
        OSFlagPost(&AlarmFlagGroup,
                   ALARM_FLAG_MISSION,
                   OS_OPT_POST_FLAG_SET,
                   &err);

        touched = 1;
      }
      prev = curr;
      OSTimeDlyHMSM(0, 0, 0, 20, OS_OPT_TIME_HMSM_STRICT, &err);
    }

    // 4. 알람이 해제될 때까지 Block (ALARM_FLAG_OFF 대기)
    OSFlagPend(&AlarmFlagGroup,
               ALARM_FLAG_OFF,
               0,
               OS_OPT_PEND_FLAG_SET_ANY | OS_OPT_PEND_NON_BLOCKING,
               0,
               &err);

    // **여기서 break가 아니라, 자연스럽게 루프 첫 부분(1)로 돌아가야 함!**
    // break;  <<<< 쓰면 안 됨!
    // continue; 혹은 아무 처리 없이 while(DEF_TRUE) 첫 부분으로 돌아가게
  }
}

static void MissionTask(void *p_arg)
{
  OS_ERR err;
  OS_FLAGS flags;
  void *msg;
  OS_MSG_SIZE msg_size;
  SensorInput input;

  (void)p_arg;

  while (DEF_TRUE)
  {
    // 1. 터치 감지될 때까지 대기
    flags = OSFlagPend(&AlarmFlagGroup,
                       ALARM_FLAG_MISSION,
                       0,
                       OS_OPT_PEND_FLAG_SET_ANY | OS_OPT_PEND_FLAG_CONSUME | OS_OPT_PEND_BLOCKING,
                       0,
                       &err);

    // 2. 미션 랜덤 선택
    int knock_missions[] = {1, 2, 3};
    srand(time(NULL));
    int idx = rand() % (sizeof(knock_missions) / sizeof(int));
    int required_knock = knock_missions[idx];
    static const char start_msg[] = "\r\n[미션] 테스트 모드: 노크 센서만 사용 중!\r\n";
    OSQPost(&USARTMsgQ, (void *)start_msg, sizeof(start_msg), OS_OPT_POST_FIFO, &err);

    char buf[128];
    snprintf(buf, sizeof(buf),
             "[테스트 미션] 노크 %d회를 감지하세요.\r\n", required_knock);
    OSQPost(&USARTMsgQ, (void *)buf, strlen(buf) + 1, OS_OPT_POST_FIFO, &err);

    OSFlagPost(&AlarmFlagGroup,
               ALARM_FLAG_KNOCK,
               OS_OPT_POST_FLAG_SET,
               &err);

    int knock_cnt = 0;
    int mission_fail = 0;

    while (1)
    {
      // 알람 해제 신호 오면 즉시 종료(예: 외부에서 강제 종료)
      if (OSFlagPend(&AlarmFlagGroup,
                     ALARM_FLAG_OFF,
                     0,
                     OS_OPT_PEND_FLAG_SET_ANY | OS_OPT_PEND_NON_BLOCKING,
                     0,
                     &err))
      {
        // 강제 종료(성공/실패 상관없이 태스크 종료)
        return;
      }

      msg = OSQPend(&SensorInputQ, 0, OS_OPT_PEND_BLOCKING, &msg_size, 0, &err);
      if (err != OS_ERR_NONE)
        continue;

      input = *(SensorInput *)msg;

      if (input.type == SENSOR_KNOCK)
      {
        knock_cnt++;
      }
      else
      {
        mission_fail = 1;
        static const char fail_msg[] = "[실패] 허용되지 않은 입력입니다. 다시 시도하세요.\r\n";
        OSQPost(&USARTMsgQ, (void *)fail_msg, sizeof(fail_msg), OS_OPT_POST_FIFO, &err);
        return; // 미션 실패!
      }

      if (knock_cnt >= required_knock)
      {

        OSTimeDlyHMSM(0, 0, 0, 20, OS_OPT_TIME_HMSM_STRICT, &err);
        USART_SendString("[미션] 테스트 모드: 조이스틱 모듈 사용 중\r\n");

        OSFlagPost(&AlarmFlagGroup,
                   ALARM_FLAG_KNOCK_SUCCESS,
                   OS_OPT_POST_FLAG_SET,
                   &err);

        /*
        // 재시작 테스트
        RTC_AlarmCmd(RTC_Alarm_A, DISABLE);
        RTC_ClearITPendingBit(RTC_IT_ALRA);
        EXTI_ClearITPendingBit(EXTI_Line17);

        RTC_CustomSetTime(8, 59, 58);
        // 꼭 50~100ms 정도 대기!
        OSTimeDlyHMSM(0, 0, 0, 100, OS_OPT_TIME_HMSM_STRICT, &err);

        RTC_SetAlarmDaily();
        continue;
        ;
        */
      }
    }

    // 이 아래는 “실패” 했을 때만 실행됨
    if (mission_fail)
    {
      OSTimeDlyHMSM(0, 0, 0, 700, OS_OPT_TIME_HMSM_STRICT, &err); // 재도전 전 잠깐 쉬기
      continue;                                                   // 바깥 while(DEF_TRUE)로 돌아가서 미션 새로 안내
    }
  }
}

// Knock sensor Task
static void KnockSensorTask(void *p_arg)
{
  OS_ERR err;
  SensorInput input;
  OS_FLAGS flags;
  uint8_t prev, curr;

  (void)p_arg;

  while (DEF_TRUE)
  {
    // 1. 미션 시작(터치 플래그)까지 대기
    flags = OSFlagPend(&AlarmFlagGroup,
                       ALARM_FLAG_KNOCK,
                       0,
                       OS_OPT_PEND_FLAG_SET_ANY | OS_OPT_PEND_FLAG_CONSUME | OS_OPT_PEND_BLOCKING,
                       0,
                       &err);

    // 2. 미션 종료(ALARM_FLAG_OFF)까지 반복 감지
    prev = KnockSensor_Read();
    while (1)
    {
      // 미션 종료 플래그 오면 바로 대기 상태로 돌아감
      if (OSFlagPend(&AlarmFlagGroup,
                     ALARM_FLAG_KNOCK_SUCCESS,
                     0,
                     OS_OPT_PEND_FLAG_SET_ANY | OS_OPT_PEND_NON_BLOCKING,
                     0,
                     &err))
      {
        OSFlagPost(&AlarmFlagGroup,
                   ALARM_FLAG_JOYSTICK_START,
                   OS_OPT_POST_FLAG_SET,
                   &err);
        break;
      }

      curr = KnockSensor_Read();

      if (curr == Bit_SET && prev == Bit_RESET)
      {
        input.type = SENSOR_KNOCK;
        OSQPost(&SensorInputQ, &input, sizeof(input), OS_OPT_POST_FIFO, &err);

        static const char msg[] = "[노크] 입력 감지됨\r\n";
        OSQPost(&USARTMsgQ, (void *)msg, sizeof(msg), OS_OPT_POST_FIFO, &err);

        // 800ms(혹은 적절한 값) 동안 입력 무시
        OSTimeDlyHMSM(0, 0, 1, 0, OS_OPT_TIME_HMSM_STRICT, &err);
      }
      else
      {
        OSTimeDlyHMSM(0, 0, 0, 20, OS_OPT_TIME_HMSM_STRICT, &err);
      }

      prev = curr;
    }
  }
}

